Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D 'relu')       (None, 30, 30, 64)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D 'relu')     (None, 13, 13, 64)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 6, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 2304)              0         
_________________________________________________________________
dropout (Dropout '0.2')      (None, 2304)              0         
_________________________________________________________________
dense (Dense 'relu')         (None, 64)                147520    
_________________________________________________________________
dropout_1 (Dropout '0.2')    (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 43)                2795      
=================================================================
Total params: 187,883
Trainable params: 187,883
Non-trainable params: 0
_________________________________________________________________
